# FilterNumericGreaterOrEqual Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericGreaterOrEqual Constructor
FilterNumericGreaterOrEqual Class See Also
---
Constructs an instance of FilterNumericGreaterOrEqual.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericGreaterOrEqual()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterNumericGreaterOrEqual()
```

# See Also
FilterNumericGreaterOrEqual Class
Autodesk.Revit.DB Namespace